import Image from "next/image";

export default function About() {
  return (
    <>
      <h2 id="multi">多人模式</h2>
      <div>
        <p style={{ textAlign: "left" }}>
          參見：Minecraft伺服器
          《Minecraft》中的多人遊戲透過玩家搭建的Minecraft伺服器執行，允許多個玩家之間進行互動，並在一個世界中與對方交流[59]。玩家可以執行自己的伺服器，或使用代管服務商提供的伺服器。單人遊戲世界支援區域網路，玩家可以在沒有伺服器的前提下進行本地電腦連接（預設只有正版玩家可以進入）[60]。《Minecraft》的多人遊戲伺服器由伺服器營運商指導，他們有使用伺服器命令的權限，如設定每天的時間或傳送附近的玩家。營運商還可以限制某些使用者名稱或IP位址的訪問[59]。多人遊戲伺服器為玩家提供了廣泛的活動空間，一些伺服器有自己獨特的規定和習慣。不同伺服器上的內容大不相同。最大以及最有名的伺服器是Hypixel，登入次數超過1400萬[61][62]。玩家對戰（PvP）模式可允許玩家之間進行戰鬥[63]。一個由社群開發的名為「CraftBukkit」的獨立非官方伺服器端[64]，使伺服器端插件的開發更為便利。它可以透過載入插件實現諸如權限、等級、虛擬貨幣和聊天格式等遊戲元素。然而CraftBukkit因為法律問題遭到終止[65]，它被另一個獨立伺服器端Spigot所替代。
          2013年，Mojang發布了伺服器代管服務「Minecraft
          Realms」，使玩家省去自己建伺服器的麻煩，從而方便、安全地執行多人遊戲伺服器[66]。只有受到邀請的玩家才可加入Realms的標準伺服器，並且不使用IP。Realms伺服器只能同時支援2人或10人線上，並且不支援使用者製作的插件。中國大陸玩家可能會因為網路連接問題導致無法正常使用此功能。
          2017年，微軟宣布將更新《Minecraft》的多人遊戲機制，將Android、iOS、Windows、Xbox
          One、任天堂Switch以及VR版本整合，更新之後的遊戲將允許在前面提到的這些遊戲平台間相互連線遊戲。此整合版被稱作基岩版，或基岩引擎。玩家在這些平台上所購買的DLC也將可以跨平台共通使用[67]。
        </p>
      </div>
    </>
  );
}
