import Image from "next/image";

export default function About() {
  return (
    <>
      <h2 id="play">遊戲玩法</h2>
      <div>
        <p style={{ textAlign: "left" }}>
          《Minecraft》是一款開放世界遊戲，玩家沒有具體要完成的目標，並且在遊戲內有極高的自由度[35]。雖然遊戲中存在進度（Java版）或成就系統（Java版1.12以前及基岩版）[36]，但並沒有要求玩家必須達成。遊戲採用第一人稱，但玩家亦可選擇第三人稱背面或第三人稱正面模式[37]。核心玩法大多圍繞破壞和放置方塊的操作。遊戲世界主要由3D方塊組成，方塊表面有像素畫圖案，代表不同的材料，如泥土、石頭、礦物、水和樹木等。玩家可以在世界各地自由移動，收集這些方塊，並將其放置在整數坐標的3D網格中，從而進行各項建設[38]。
          遊戲開始時，玩家會出生在一個由程式生成的、幾乎沒有大小限制的世界裡[39]。世界分為沙漠、叢林和雪原等生態域[40][41]。玩家可以找到各種生態域，如平原、高山、雪原、森林和海洋等[39]。遊戲遵循日夜交替周期，一天對應現實世界的20分鐘。
          《Minecraft》中的部分敵對生物，從左到右分別為：殭屍、蜘蛛、終界使者、苦力怕[註
          4]和骷髏
          在遊戲中，玩家可能會遇到很多非玩家角色，如動物、村民和怪物等[42]。牛、豬、雞、羊、兔子、魚等友好生物可以被獵殺或養殖以獲取食物或原材料。相反地，在黑暗區域如洞穴或夜間，可能會有敵對生物出現，如蜘蛛、骷髏、殭屍、苦力怕等[39]。
          遊戲世界透過隨機程式生成，因此幾乎不可能隨機生成出兩幅完全相同的世界[43][44]。雖然世界存在高度限制，但遊戲允許在水平面上生成一個可近似看作無限大的世界[43]。
          玩家還可以在遊戲中使用原始的機械裝置、電路、邏輯閘以及遊戲內建的材料「紅石」來構建更複雜的機械[45]。而遊戲的物理系統不常符合真實物理法則，例如絕大多數固體方塊都不會受到重力的影響[46]。
          《Minecraft》中除了主世界外還有兩個不同的維度——地獄和終界[47]。地獄可透過玩家打造的傳送門進入。其包含許多獨特的資源，例如地獄石、靈魂沙及地獄石英等[48]。終界是一些漂浮的貧瘠的群島，存在著大量終界使者和一隻末影龍Boss[49]。在玩家擊殺末影龍後會獲得「解放終界」進度，且可以前往終界船。此後，玩家可以繼續進入終界外島探索，或者透過返回傳送門返回主世界，這也被玩家視作「遊戲通關」。
          遊戲有四種級別可變的難度系統，最容易的難度（和平）會移除絕大多數自然生成的敵對生物，但由於無法從敵對生物取得關鍵物品，因而無法通關遊戲。除和平難度外，飢餓值會隨著玩家活動緩慢減少，因此玩家還需要透過狩獵、種植等方式取得食物來恢復飢餓值。
        </p>
      </div>
    </>
  );
}
